/*

  ******************************************************************************
  * @file 			( фаил ):   animacion.h
  * @brief 		( описание ):  	Слайды для анимации в виде массива 8 на 8
  ******************************************************************************
  * @attention 	( внимание ):
  ******************************************************************************
  
*/

#ifndef _ANIM_MASS_H
#define _ANIM_MASS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------*/

// Обязательно нужен #include "main.h" 
// чтоб отдельно не подключать файлы связанные с МК и стандартными библиотеками
#include "main.h"

// Анимация кадры

// Кадр 1
uint8_t a[8]={ 0x18, 0x24, 0x24, 0x18, 0x7E, 0x18, 0x24, 0x42 };

// Кадр 2
uint8_t b[8]={ 0x18, 0x24, 0x24, 0x1A, 0x7C, 0x18, 0x64, 0x02 };

/*
// Кадр 3
uint8_t c[8];
	
// Кадр 4
uint8_t d[8];
	
// Кадр 5
uint8_t e[8];
	
// Кадр 6
uint8_t f[8];
*/	

#ifdef __cplusplus
}
#endif

#endif	/*	_ANIM_MASS_H */

/************************ (C) COPYRIGHT GKP *****END OF FILE****/
